In [402]:
import pandas as pd
df=pd.read_csv('highest_gross_video_game_films.csv')
#df.shape
#df
df.head()

,Rank,Peak,Title,video_game,game_pub,Date,gross,Distributor,Format
0,1,1,Warcraft,Warcraft,Blizzard Entertainment,2016-06-10,439048914,Universal Pictures,Live-action
1,2,2,Detective Pikachu,Detective Pikachu and Pokémon,"Nintendo, The Pokémon Company",2019-05-10,433230304,Warner Bros. Pictures,Live-action/animated
2,3,2,Rampage,Rampage,Midway Games,2018-04-13,428028233,Warner Bros. Pictures,Live-action
3,4,4,Sonic the Hedgehog 2,Sonic the Hedgehog,Sega,2022-04-08,404372904,Paramount Pictures,Live-action/animated
4,5,4,Uncharted,Uncharted,Sony Interactive Entertainment,2022-02-18,401748820,Sony Pictures Releasing,Live-action

In [403]:
df[['Year','Month','Date']]=df['Date'].str.split("-",n=2,expand=True)
#df.head(20)

In [404]:
df['Year']=df['Year'].astype(int)
df['Year'].unique()
#df['Year'].nunique()

array([2016, 2019, 2018, 2022, 2010, 2020, 2017, 2001, 2012, 2014, 1998,
       2003, 2007, 1999, 2004, 1995, 2002, 1994, 2006, 2008, 2021, 2015,
       2000, 2011, 2005, 1997, 2009, 1993])

In [405]:
df.dtypes

Rank            int64
Peak            int64
Title          object
video_game     object
game_pub       object
Date           object
gross           int64
Distributor    object
Format         object
Year            int64
Month          object
dtype: object

In [406]:
#How to use lambada
x=lambda x: x+100
       #x parameter, x+100 is return statement
#print(x(10))

In [407]:
# if the movie is released after 2017 then movie is new else movie is old we will do this using Lambda Function
def movie_type(Year):
    if Year>2017:
        return 'New Movie'
    else:
        return "Old movie"

In [408]:
#Applying lambda to year column
use_apply= df['Year'].apply(lambda year: movie_type(year))
                            #passing all years in the function as argument
#use_apply
df['Movie Type']=use_apply
df[['Year','Movie Type']].head(10)

   Year Movie Type
0  2016  Old movie
1  2019  New Movie
2  2018  New Movie
3  2022  New Movie
4  2022  New Movie
5  2016  Old movie
6  2010  Old movie
7  2020  New Movie
8  2017  Old movie
9  2010  Old movie

In [409]:
df.head(5)

,Rank,Peak,Title,video_game,game_pub,Date,gross,Distributor,Format,Year,Month,Movie Type
0,1,1,Warcraft,Warcraft,Blizzard Entertainment,10,439048914,Universal Pictures,Live-action,2016,06,Old movie
1,2,2,Detective Pikachu,Detective Pikachu and Pokémon,"Nintendo, The Pokémon Company",10,433230304,Warner Bros. Pictures,Live-action/animated,2019,05,New Movie
2,3,2,Rampage,Rampage,Midway Games,13,428028233,Warner Bros. Pictures,Live-action,2018,04,New Movie
3,4,4,Sonic the Hedgehog 2,Sonic the Hedgehog,Sega,08,404372904,Paramount Pictures,Live-action/animated,2022,04,New Movie
4,5,4,Uncharted,Uncharted,Sony Interactive Entertainment,18,401748820,Sony Pictures Releasing,Live-action,2022,02,New Movie

#### Part#2

In [410]:
import pandas as pd
import numpy as np
dff=pd.read_csv('all_data.csv')
dff.head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,176558,USB-C Charging Cable,2,11.95,04/19/19 08:46,"917 1st St, Dallas, TX 75001"
1,NaN,NaN,NaN,NaN,NaN,NaN
2,176559,Bose SoundSport Headphones,1,99.99,04/07/19 22:30,"682 Chestnut St, Boston, MA 02215"
3,176560,Google Phone,1,600,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"
4,176560,Wired Headphones,1,11.99,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"

In [411]:
#dff.dtypes
dff['Price Each']=pd.to_numeric(dff['Price Each'],errors='coerce')
dff['Quantity Ordered']=pd.to_numeric(dff['Quantity Ordered'],errors='coerce')

In [412]:
# Apply function can be applied to a dataframe or a series object
# 1st way of using apply function is to use it with built-in functions
# Example using the numpy sqrt() function
dff['Price Each']=dff['Price Each'].apply(np.sqrt)
dff['Price Each']

0          3.456877
1               NaN
2          9.999500
3         24.494897
4          3.462658
            ...
186845     1.729162
186846    26.457513
186847    26.457513
186848    19.493332
186849     3.456877
Name: Price Each, Length: 186850, dtype: float64

In [413]:
dff['Price Each']=dff['Price Each'].apply(np.mean)
dff['Price Each'].head(10)

0     3.456877
1          NaN
2     9.999500
3    24.494897
4     3.462658
5     3.462658
6     3.456877
7     9.999500
8     3.456877
9    41.231056
Name: Price Each, dtype: float64

In [414]:
ex_1=dff[['Price Each','Quantity Ordered']].apply(np.mean,axis=1)  #,axis=1
ex_1

Price Each          9.686721
Quantity Ordered    1.124383
dtype: float64

In [415]:
dff.groupby('Price Each')['Quantity Ordered'].apply(np.mean)
#dff.groupby('Price Each')['Quantity Ordered'].mean()     # both have same

Price Each
1.729162     1.502689
1.959592     1.343004
3.456877     1.094599
3.462658     1.088709
3.866523     1.071983
9.999500     1.009906
10.487612    1.006828
12.247040    1.005728
12.247449    1.007203
17.320508    1.003958
19.493332    1.002912
19.748164    1.002247
20.000000    1.001453
24.494897    1.001024
26.457513    1.001023
31.622618    1.000484
41.231056    1.000847
Name: Quantity Ordered, dtype: float64